In [1]:
import pandas as pd

In [ ]:
data = {
    "Name":["Ram","Shyam","Ghanshyam","Krishna","Arjun","Karna","Sita","Radh"],
    "Age":[10,None,30,40,50,60,70,80],
    "Salary":[50000,60000,70000,80000,90000,100000,110000,120000],
    "City":["Nagpur","Mumbai","Delhi","Pune","Bangalore","Kolkata","Chennai","Ahmedabad"],
    "Performance Score":[90,90,65,76,87,34,76,100]
}

df = pd.DataFrame(data)
df

        Name   Age    Salary       City  Performance Score
0        Ram  10.0   50000.0     Nagpur               90.0
1      Shyam   NaN       NaN     Mumbai                NaN
2  Ghanshyam  30.0   70000.0      Delhi               65.0
3    Krishna  40.0   80000.0       Pune               76.0
4      Arjun  50.0   90000.0  Bangalore               87.0
5      Karna  60.0  100000.0    Kolkata               34.0
6       Sita  70.0  110000.0    Chennai               76.0
7       Radh  80.0  120000.0  Ahmedabad              100.0

In [16]:
print(round(df["Age"].mean())) # mean of salary find
print(round(df["Salary"].max()))
print(round(df["Salary"].min()))
print(round(df["Salary"].sum()))

49
120000
50000
620000